# RemoveNonContinuousRail Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailStructure..::..RemoveNonContinuousRail Method
NonContinuousRailStructure Class See Also
---
Removes Non-Continuous Rail from the Rail Structure.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public void RemoveNonContinuousRail(
	int index
)
```

Visual Basic
---
```text
Public Sub RemoveNonContinuousRail ( _
	index As Integer _
)
```

Visual C++
---
```text
public:
void RemoveNonContinuousRail(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 Non-Continuous Rail index.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index index is out of range. |

# See Also
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace